//随机
var isRun=true;

//请将output.txt的内容复制在[]中
var a = ["丁攀","丁琳","么红军","于元杰","于小洋","代正文","任鹏程","何琳","余兆聪","余星月","余玥","傅如意","党静","冯佳康","冯再强","冯芊","刘传荣","刘倩秀","刘好","刘婷","刘杨 信息122","刘松明","刘苗苗","刘薇","刘静","包国勍 ","卢钊林","史海娟","合照","吕书娥","吕宗强","吕文慧","吕晓敏","吕雪琴","吴丽欣","吴娇","吴昊","吴王天成","吴续洋","吴越","吴银玉","周广红","周煊青","周燕","周锋","唐园园","唐昕茹","姚云","姚军","姜翠梅","孙万通","孙亚男","孙倩","孙子惠","孙杞爽","孟凡博","孟真","宁珈","宋映东","宋纯洁","尹志莹","左宏宇","张勇","张华","张叶","张子旭","张悦","张晶晶","张枥文","张欣","张涛","张涛2","张淼","张潇化","张燕","张磊","张舒宁","张雅硕","张雨","张青上","张靖","彭东浩","徐一铭","徐婧婷","徐镇南","房玉菡","曹诗文","曾文鑫","曾明霞","朱丙芹","朱丽丽","朱成利","朱曼曼","李俊楠","李卓","李发伟","李希浩","李思睿","李文君","李新","李明","李晓","李晓霞","李晨旭","李炯明","李语禅","李静","李颖","杜晓曦","杜泓嶙","杜珍","杨帅","杨潇涵","林小果3","林薇","林雅乐","柴航航","栾晓霞","桑爱林","梁兆林","樊姜涛","樊涛","武倩","段浩宁","段浩然","殷倩","毛兆欣","沈建平","沙海燕","涂济森","潘政杰","潘涛涛","潘玉爽","焦彤","王义鹏·","王习潺","王亚男","王传涛","王启帆","王婷婷","王恒远","王慧娟","王振","王晋如","王晓琨","王月宏","王琳","王觅","王钧霞","王雅婷","王雅文","王鲁齐","理雯雯","田凯文","由洪瑞","皇甫芳","祁鹏展","程亚如","窦溪温","童玲","罗倩","聂士强","胡成","胡潇","臧小峰","苏少菊","苏欣","苗婷","范国帅","范志华","范明智","范永霞","葛祥栋","董玉霞","蒋莹","袁娜","袁舟舟","解建","许存","谢涵","谢雨","赵倩玉","赵姗姗","赵巾莹","赵艳艳","赵雨迎","邢云飞","邱瑞星","邱集钰","邵现伟","邹子晴","郑姝","郭倩","郭兵","郭力榕","金丹","金康","钟婉源","闫绘","阎欣君","陈兼敏","陈向楠","陈婷那","陈川周","陈景新","陈梦钰","陈继康","陈鑫旺","陈高琴","雷斌","韦霄玫","马凯迪","马和良","马成浩","高晓燕","高晓珍","高言敏","黄茹意",];

var c=1;

// var a2 = new Array();

$("#button").click(function(e) {
	c++;
	action();
});



function action(){
	if(c%2==0){
		isRun=true;
		run();
		document.getElementById("button").value="结束";
	}else{
		isRun=false;
		document.getElementById("button").value="开始";
	}

}

function run(){
	var i = Math.floor(Math.random() * a.length+ 1)-1;
	document.getElementById("show").innerHTML=a[i];
	var pic=a[i];
	document.getElementById("images").innerHTML="<img src="+"./images/"+pic+".jpg"+" alt="+"Responsive image"+" class="+"img-responsive scalesParent"+">";
	
	//停止
	if(isRun==false){
		// var b =true;
		// for(var j in a2){
		// 	if(a2[j]==i){
		// 		b=false;
		// 	}
		// }
		// if(b){
		// 	a2[a2.length]=i;
		return;
		// }
	}
	setTimeout("run()",20);
}

